mikaelpatel/Cosa-CustomBoard/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
#
# @section Description
# The Cosa Arduino Custom Board template definition file.
#
# This file is part of the Arduino Che Cosa project.

##
# CUSTOM BOARDS
##

# AVR:ATmega328
# Int. RC Osc.8 MHz; Start-up time PWRDWN/RESET: 6 CK/14 CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (256 words, 0x3f00).
cosa-custom-board.name=Cosa Custom Board (ATmega328, 8 MHz internal clock)
cosa-custom-board.upload.tool=avrdude
cosa-custom-board.upload.protocol=stk500v1
cosa-custom-board.upload.speed=19200
cosa-custom-board.upload.maximum_size=32768
cosa-custom-board.upload.maximum_data_size=2048
cosa-custom-board.upload.maximum_eeprom_size=1024

cosa-custom-board.bootloader.tool=avrdude
cosa-custom-board.bootloader.low_fuses=0xE2
cosa-custom-board.bootloader.high_fuses=0xDE
cosa-custom-board.bootloader.extended_fuses=0x05

cosa-custom-board.build.mcu=atmega328p
cosa-custom-board.build.f_cpu=8000000L
cosa-custom-board.build.board=VENDOR_PRODUCT
cosa-custom-board.build.variant=VENDOR/PRODUCT
cosa-custom-board.build.core=Cosa:cosa

